## Lecture session for Pandas in Python

**DATA SCIENCE PROCESS, DATA QUERY, AND MANIPULATION**

In [12]:
#Importing NumPy library

import numpy as np

In [13]:
#Importing Pandas library

import pandas as pd

In [14]:
#Creating a dataframe
#Each column and each row in a dataframe is called a series

df = pd.DataFrame(np.random.randint(1,100,(5,4)), ['A','B','C','D','E'], ['W','X','Y','Z'])
df

    W   X   Y   Z
A  47  50  37  18
B  50  40  32  86
C  14  57  46  22
D  87  38  54  46
E  67  65  63  37

In [15]:
#Getting the shape fo dataframes

df.shape

(5, 4)

In [16]:
#appending new columns
df['new']=df['W']+df['Y']
df

    W   X   Y   Z  new
A  47  50  37  18   84
B  50  40  32  86   82
C  14  57  46  22   60
D  87  38  54  46  141
E  67  65  63  37  130

#### Indexing and slicing

In [17]:
#removing the newly added column

df.drop('new', axis=1)

    W   X   Y   Z
A  47  50  37  18
B  50  40  32  86
C  14  57  46  22
D  87  38  54  46
E  67  65  63  37

In [18]:
df

    W   X   Y   Z  new
A  47  50  37  18   84
B  50  40  32  86   82
C  14  57  46  22   60
D  87  38  54  46  141
E  67  65  63  37  130

In [19]:
#removing the newly added column (Note: use inplace to reflect changes in the originally defined dataframe)

df.drop('new', axis=1, inplace = True)

In [20]:
df

    W   X   Y   Z
A  47  50  37  18
B  50  40  32  86
C  14  57  46  22
D  87  38  54  46
E  67  65  63  37

In [21]:
#Selecing a single column

df['X']

A    50
B    40
C    57
D    38
E    65
Name: X, dtype: int32

In [23]:
#Selecting multiple columns

df[['X','Z']]

    X   Z
A  50  18
B  40  86
C  57  22
D  38  46
E  65  37

In [24]:
#Selecing rows based on label via loc[ ] indexer

df.loc['C']

W    14
X    57
Y    46
Z    22
Name: C, dtype: int32

In [25]:
#Selecing multiple rows via loc[ ] indexer

df.loc[['C','E']]

    W   X   Y   Z
C  14  57  46  22
E  67  65  63  37

In [26]:
#Selecting elemens via both rows and columns via loc[ ] indexer

df.loc[['B','C','D'],['X','Y']]

    X   Y
B  40  32
C  57  46
D  38  54

#### Conditional selection

In [3]:
df = pd.DataFrame({'col1':[1,2,3,4,5,6,7,8],
                   'col2':[444,555,666,444,666,111,222,222],
                   'col3':['orange','apple','grape','mango','jackfruit','watermelon','banana','peach']})
df

   col1  col2        col3
0     1   444      orange
1     2   555       apple
2     3   666       grape
3     4   444       mango
4     5   666   jackfruit
5     6   111  watermelon
6     7   222      banana
7     8   222       peach

In [8]:
#What fruit corresponds to the number 555 in ‘col2’?

df[df['col2']==555]['col3']

1    apple
Name: col3, dtype: object

In [10]:
#What fruit corresponds to the minimum number in ‘col2’?

df[df['col2']==df['col2'].min()]['col3']

5    watermelon
Name: col3, dtype: object

#### Basic operations on dataframes

In [18]:
#Creating a dataframe from a dictionary

df = pd.DataFrame({'col1':[1,2,3,4,5,6,7,8],
                   'col2':[444,555,666,444,666,111,222,222],
                   'col3':['orange','apple','grape','mango','jackfruit','watermelon','banana','peach']})
df

   col1  col2        col3
0     1   444      orange
1     2   555       apple
2     3   666       grape
3     4   444       mango
4     5   666   jackfruit
5     6   111  watermelon
6     7   222      banana
7     8   222       peach

In [19]:
#Returns only the first five rows

df.head()

   col1  col2       col3
0     1   444     orange
1     2   555      apple
2     3   666      grape
3     4   444      mango
4     5   666  jackfruit

In [20]:
#Info about the dataframe

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
col1    8 non-null int64
col2    8 non-null int64
col3    8 non-null object
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

In [21]:
#Statistics of the dataframe

df.describe()

          col1      col2
count  8.00000    8.0000
mean   4.50000  416.2500
std    2.44949  211.8576
min    1.00000  111.0000
25%    2.75000  222.0000
50%    4.50000  444.0000
75%    6.25000  582.7500
max    8.00000  666.0000

In [22]:
#Sum of a specified column

df['col2'].sum()

3330

In [23]:
#Returns the list of unique values along the indexed column 

df['col2'].unique()

array([444, 555, 666, 111, 222], dtype=int64)

In [24]:
#Returns the total number of unique values along the indexed column 

df['col2'].nunique()

5

In [25]:
#Returns the number of occurences of each unique value

df['col2'].value_counts()

222    2
444    2
666    2
111    1
555    1
Name: col2, dtype: int64

In [26]:
#Writing concise functions

def times2(x):
    return(x*2)

In [27]:
#Operations on dataframes using functions

df['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
4    1332
5     222
6     444
7     444
Name: col2, dtype: int64

In [28]:
#Sorting based on columns 

df.sort_values('col2', ascending = True)

   col1  col2        col3
5     6   111  watermelon
6     7   222      banana
7     8   222       peach
0     1   444      orange
3     4   444       mango
1     2   555       apple
2     3   666       grape
4     5   666   jackfruit

#### Grouping values in dataframes

In [16]:
#Creating a dataframe from a dictionary

data = {
    'key' : ['A', 'B', 'C', 'A', 'B', 'C'],
    'data1' : [1, 2, 3, 4, 5, 6],
    'data2' : [10, 11, 12, 13, 14, 15],
    'data3' : [20, 21, 22, 13, 24, 25]
}

df1 = pd.DataFrame(data)
df1

  key  data1  data2  data3
0   A      1     10     20
1   B      2     11     21
2   C      3     12     22
3   A      4     13     13
4   B      5     14     24
5   C      6     15     25

In [17]:
# Grouping and summing values in all the columns based on the column 'key'

df1.groupby('key').sum()

     data1  data2  data3
key
A        5     23     33
B        7     25     45
C        9     27     47

In [18]:
# Grouping and summing values in the selected columns based on the column 'key'

df1.groupby('key')[['data1', 'data2']].sum()

     data1  data2
key
A        5     23
B        7     25
C        9     27

#### Missing values: Dropping and filling values in dataframes

In [29]:
#Creating a dataframe from a dictionary

df = pd.DataFrame({'col1':[1,2,3,4,None,6,7,None],
                   'col2':[444,555,None,444,666,111,None,222],
                   'col3':['orange','apple','grape','mango','jackfruit','watermelon','banana','peach']})
df

   col1   col2        col3
0   1.0  444.0      orange
1   2.0  555.0       apple
2   3.0    NaN       grape
3   4.0  444.0       mango
4   NaN  666.0   jackfruit
5   6.0  111.0  watermelon
6   7.0    NaN      banana
7   NaN  222.0       peach

In [30]:
df_dropped = df.dropna()
df_dropped

   col1   col2        col3
0   1.0  444.0      orange
1   2.0  555.0       apple
3   4.0  444.0       mango
5   6.0  111.0  watermelon

In [31]:
df_filled1 = df.fillna(0)
df_filled1

   col1   col2        col3
0   1.0  444.0      orange
1   2.0  555.0       apple
2   3.0    0.0       grape
3   4.0  444.0       mango
4   0.0  666.0   jackfruit
5   6.0  111.0  watermelon
6   7.0    0.0      banana
7   0.0  222.0       peach

In [32]:
df_filled2 = df.fillna(df.mean())
df_filled2

       col1   col2        col3
0  1.000000  444.0      orange
1  2.000000  555.0       apple
2  3.000000  407.0       grape
3  4.000000  444.0       mango
4  3.833333  666.0   jackfruit
5  6.000000  111.0  watermelon
6  7.000000  407.0      banana
7  3.833333  222.0       peach

#### Reading and writing .csv files

In [44]:
#Reading a .csv file

readfilecsv = pd.read_csv('CSV_ReadingFile.csv')

In [45]:
readfilecsv

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [46]:
#Creating and writing to a .csv file

readfilecsv.to_csv('CSV_WritingFile1.csv')
pd.read_csv('CSV_WritingFile1.csv')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [47]:
#Creating and writing to a .csv file by excluding row labels 

readfilecsv.to_csv('CSV_WritingFile2.csv', index = False)
pd.read_csv('CSV_WritingFile2.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [48]:
#Similar to reading and writing .csv files, you can also read and write .xslx files as below (useful to know this)

In [42]:
#Reading a .xlsx file

readfileexcel = pd.read_excel('Excel_ReadingFile.xlsx', sheet_name='Sheet1')
readfileexcel

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [43]:
#Creating and writing to a .xlsx file

readfileexcel.to_excel('Excel_WritingFile.xlsx', sheet_name='MySheet')
pd.read_excel('Excel_WritingFile.xlsx', sheet_name='MySheet')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15